KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_СертификатКачества/КАНАТ_СертификатКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_СертификатКачества</name>
  <basedOn>Document.КАНАТ_РезультатИспытаний</basedOn>
  <attributes>
    <name>ДокументОснования</name>
    <type>
      <types>DocumentRef.КАНАТ_РезультатИспытаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерБухты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСертификатаКачества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовленияГотовойПродукции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РезультатИспытаний</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимоеОтклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_СертификатКачества/ObjectModule.bsl
//++Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка.
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КАНАТ_РезультатИспытаний") Тогда
		// Заполнение шапки
		ЗаказКлиента = ДанныеЗаполнения.ЗаказКлиента;
		ЗаказНаПроизводство = ДанныеЗаполнения.ЗаказНаПроизводство;
		Примечание = ДанныеЗаполнения.Примечание;
		Продукция = ДанныеЗаполнения.Продукция;
		ДокументОснования = ДанныеЗаполнения.Ссылка;
		НомерБухты =  ДанныеЗаполнения.НомерБухты;
		Для Каждого ТекСтрокаРезультатИспытаний Из ДанныеЗаполнения.РезультатИспытаний Цикл
			НоваяСтрока = РезультатИспытаний.Добавить();
			НоваяСтрока.ДопустимоеОтклонение = ТекСтрокаРезультатИспытаний.ДопустимоеОтклонение;
			НоваяСтрока.ЕдИзм = ТекСтрокаРезультатИспытаний.ЕдИзм;
			НоваяСтрока.Норма = ТекСтрокаРезультатИспытаний.Норма;
			НоваяСтрока.Показатель = ТекСтрокаРезультатИспытаний.Показатель;
			НоваяСтрока.Факт = ТекСтрокаРезультатИспытаний.Факт;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
 //--Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка.
